# Вывести последнюю букву в слове
word = 'Архангельск'
# ???
#print(word[-1])

# Вывести количество букв "а" в слове
word = 'Архангельск'
# ???
#print(word.count('а')+word.count('А'))


# Вывести количество гласных букв в слове
word = 'Архангельск'
# ???
#number_of_vowels = len([char for char in word if char in "ауоыэяюёиеАУОЫЭЯЮЁИЕ"])
#print(number_of_vowels)


# Вывести количество слов в предложении
sentence = 'Мы приехали в гости'
# ???
#number_of_words = len(sentence.split())
#print(number_of_words)


# Вывести первую букву каждого слова на отдельной строке
sentence = 'Мы приехали в гости'
# ???
#sentence_list = sentence.split()
#for word in sentence_list:
#    print(word[0])


# Вывести усреднённую длину слова в предложении
sentence = 'Мы приехали в гости'
# ???
#print(f'{len(sentence.replace(" ",""))/len(sentence.split())}')

